#+title: org table与dataframe的研究
** 读取org table转换成DataFrame
假设有个org table 名为: #+name: t1, 使用:var t=t1就可以加载该表格. 但是这样字段名称没有加载.
#+name: t1
| a   |   b |
|-----+-----|
| 1   |   2 |
| 3   |   4 |

#+begin_src python :var t=t1 :results output
  import pandas as pd
  df = pd.DataFrame(t) # t由list<list>转换成了DataFrame对象
  print(df)
#+end_src

#+RESULTS:
:    0  1
: 0  1  2
: 1  3  4

** 确保org table字段名称也被加载
在字段名下面增加一行，就可以获得字段名称
#+name: t2
| a | b |
|   |   |
|---+---|
| 1 | 2 |
| 3 | 4 |

#+begin_src python :var t=t2 :results output
  import pandas as pd
  df = pd.DataFrame(t) # t由list<list>转换成了DataFrame对象
  print(df)
#+end_src

#+RESULTS:
:    0  1
: 0  a  b
: 1      
: 2  1  2
: 3  3  4

** 获取不带字段名的数据
通过iloc使用python的切片功能截取指定范围的行获得数据, 并重新建立索引
#+name: t3
| a | b |
|   |   |
|---+---|
| 1 | 2 |
| 3 | 4 |

#+begin_src python :var t=t3 :results output
  import pandas as pd
  df = pd.DataFrame(t) # t由list<list>转换成了DataFrame对象
	df = df.iloc[2::]
	df = df.reset_index(drop=True)
  print(df)
#+end_src

#+RESULTS:
:    0  1
: 0  1  2
: 1  3  4

*** 一种是:return属性指定变量名称
:results verbatim可以保证输出结果没有被处理
#+BEGIN_SRC python :exports both :results verbatim :return df
import pandas as pd
df = pd.DataFrame({'A': [1000, 1000], 'B' : [60, 100]})
#+END_SRC

#+RESULTS:
:       A    B
: 0  1000   60
: 1  1000  100

*** 另一种是显示所有输出到stdout的信息
只需要设置:results output
#+BEGIN_SRC python :exports both :results output
import pandas as pd
test = pd.DataFrame({'A': [1000, 1000], 'B' : [60, 100]})
print(test)


#+END_SRC

#+RESULTS:
:       A    B
: 0  1000   60
: 1  1000  100
: /home/dean/work/pyenv/quantopianPython/bin/python

** 将dataframe转变为org table
   主要是使用这个属性:results table, 然后先将df转换成csv文本, 并且按照,分隔，按照\n换行。
   df里面包含了字段名称, df.values里面包含了值, [None]表示分隔行
   #+BEGIN_SRC python :exports both :results table
     import pandas as pd
     df = pd.DataFrame({'A': [1000, 1000], 'B' : [60, 100]})
     result = [list(df)] + [None] + df.values.tolist()
     return result
   #+END_SRC
    
   #+RESULTS:
   |    A |   B |
   |------+-----|
   | 1000 |  60 |
   | 1000 | 100 |

